SELECT
    REF_L_C     , REF_L_NM   , REF_M_C    ,
    REF_M_NM    , REF_S_C    , REF_S_NM   ,
    REF_D_C     , REF_D_NM   , YUHYO_YN   ,
    REF_CTNT1   , REF_CTNT2  , REF_CTNT3
FROM
    RPT_CODE_INFO
WHERE
    REF_L_C = 110
  AND REF_M_C = NVL(28, REF_M_C)
  AND REF_S_C = NVL(200, REF_S_C)
ORDER BY
    REF_L_C, REF_M_C, REF_S_C, REF_D_C

-- 회계별평잔보고서 
'02820001100000023',
'02820080600000199',
'02820080600000299',
'02820080600000399',
'02820027100000023',
'02820028100000223',
'02820028100000323',
'02820028200000023',
'02820028200000123',
'02820028200000223',
'02820028200000323',
'02820028230000023',
'02820030100000023',
'02820030200000023',
'02820035100000023',
'02820035100000099',
'02820035100000123',
'02820035100000199',
'02820038100000023',
'02820041100000023',
'02820041200000023',
'02820042100000023',
'02820042200000023',
'02820075690000023',
'02820075690000099',
'02820075690000199',
'02820075690000299',
'02820075690000399',
'02820075690000499',
'02820075690000599',
'02820075690000699',
'02820075690000799',
'02820075690000899',
'02820075690000999',
'02820001100000024',
'02820080600000199',
'02820080600000299',
'02820080600000399',
'02820027100000024',
'02820028100000224',
'02820028100000324',
'02820028200000024',
'02820028200000124',
'02820028200000224',
'02820028200000324',
'02820028230000024',
'02820030100000024',
'02820030200000024',
'02820035100000024',
'02820035100000099',
'02820035100000124',
'02820035100000199',
'02820038100000024',
'02820041100000024',
'02820041200000024',
'02820042100000024',
'02820042200000024',
'02820075690000024',
'02820075690000099',
'02820075690000199',
'02820075690000299',
'02820075690000399',
'02820075690000499',
'02820075690000599',
'02820075690000699',
'02820075690000799',
'02820075690000899',
'02820075690000999'

-- 금고운용현황

'02820001100000023',
'02820001100000024',
'02820001600000199',
'02820001600000299',
'02820001600000499',
'02820001900000199',
'02820027100000023',
'02820027100000024',
'02820030100000023',
'02820030100000024',
'02820030200000023',
'02820030200000024',
'02820035100000023',
'02820035100000024',
'02820035100000099',
'02820035100000123',
'02820035100000124',
'02820035100000199',
'02820041100000023',
'02820041100000024',
'02820042100000023',
'02820042100000024',
'02820075690000013',
'02820075690000022',
'02820075690000023',
'02820075690000024',
'02820075690000099',
'02820075690000123',
'02820075690000124',
'02820075690000199',
'02820075690000223',
'02820075690000224',
'02820075690000299',
'02820075690000499',
'02820075690000599',
'02820075690000799',
'02820075690000999',
'02820080600000199',
'02820080600000299',
'02820080600000399',
'02820080600000499',
'02820080600000899',
'02820080600000999',
'02820080600001399',
'02820080600001499',
'02820080600001599',
'02820080600001699',
'02820080600001799',
'02820080600001899',
'02820080600001999',
'02820080600002199',
'02820080600002299',
'02820080600002399',
'02820080900000099'

SELECT
    A.GUBUN,
    A.GONGGEUM_GYEJWA,
    A.GONGGEUM_GYEJWA_NM
FROM (SELECT CASE WHEN SUBSTR(FIL_100_CTNT5, 16, 2) = '99' THEN FIL_100_CTNT5 ELSE SUBSTR(FIL_100_CTNT5, 0, 15) || 'YY' END AS GONGGEUM_GYEJWA,
             CASE
                 WHEN SIGUMGO_AC_NM LIKE '%기금%' THEN 2
                 WHEN SIGUMGO_AC_NM LIKE '%세입세출외현금%' THEN 3
                 ELSE 1 END AS GUBUN,
             SIGUMGO_AC_NM  AS GONGGEUM_GYEJWA_NM
      FROM ACL_SIGUMGO_MAS
      WHERE MNG_NO = 1
        AND FIL_100_CTNT5 IN (
                              '02820001100000023',
                              '02820001100000024',
                              '02820001600000199',
                              '02820001600000299',
                              '02820001600000499',
                              '02820001900000199',
                              '02820027100000023',
                              '02820027100000024',
                              '02820030100000023',
                              '02820030100000024',
                              '02820030200000023',
                              '02820030200000024',
                              '02820035100000023',
                              '02820035100000024',
                              '02820035100000099',
                              '02820035100000123',
                              '02820035100000124',
                              '02820035100000199',
                              '02820041100000023',
                              '02820041100000024',
                              '02820042100000023',
                              '02820042100000024',
                              '02820075690000013',
                              '02820075690000022',
                              '02820075690000023',
                              '02820075690000024',
                              '02820075690000099',
                              '02820075690000123',
                              '02820075690000124',
                              '02820075690000199',
                              '02820075690000223',
                              '02820075690000224',
                              '02820075690000299',
                              '02820075690000499',
                              '02820075690000599',
                              '02820075690000799',
                              '02820075690000999',
                              '02820080600000199',
                              '02820080600000299',
                              '02820080600000399',
                              '02820080600000499',
                              '02820080600000899',
                              '02820080600000999',
                              '02820080600001399',
                              '02820080600001499',
                              '02820080600001599',
                              '02820080600001699',
                              '02820080600001799',
                              '02820080600001899',
                              '02820080600001999',
                              '02820080600002199',
                              '02820080600002299',
                              '02820080600002399',
                              '02820080900000099'
          )
        AND FIL_100_CTNT5 NOT IN (
                                  '02820001100000023',
                                  '02820080600000199',
                                  '02820080600000299',
                                  '02820080600000399',
                                  '02820027100000023',
                                  '02820028100000223',
                                  '02820028100000323',
                                  '02820028200000023',
                                  '02820028200000123',
                                  '02820028200000223',
                                  '02820028200000323',
                                  '02820028230000023',
                                  '02820030100000023',
                                  '02820030200000023',
                                  '02820035100000023',
                                  '02820035100000099',
                                  '02820035100000123',
                                  '02820035100000199',
                                  '02820038100000023',
                                  '02820041100000023',
                                  '02820041200000023',
                                  '02820042100000023',
                                  '02820042200000023',
                                  '02820075690000023',
                                  '02820075690000099',
                                  '02820075690000199',
                                  '02820075690000299',
                                  '02820075690000399',
                                  '02820075690000499',
                                  '02820075690000599',
                                  '02820075690000699',
                                  '02820075690000799',
                                  '02820075690000899',
                                  '02820075690000999',
                                  '02820001100000024',
                                  '02820080600000199',
                                  '02820080600000299',
                                  '02820080600000399',
                                  '02820027100000024',
                                  '02820028100000224',
                                  '02820028100000324',
                                  '02820028200000024',
                                  '02820028200000124',
                                  '02820028200000224',
                                  '02820028200000324',
                                  '02820028230000024',
                                  '02820030100000024',
                                  '02820030200000024',
                                  '02820035100000024',
                                  '02820035100000099',
                                  '02820035100000124',
                                  '02820035100000199',
                                  '02820038100000024',
                                  '02820041100000024',
                                  '02820041200000024',
                                  '02820042100000024',
                                  '02820042200000024',
                                  '02820075690000024',
                                  '02820075690000099',
                                  '02820075690000199',
                                  '02820075690000299',
                                  '02820075690000399',
                                  '02820075690000499',
                                  '02820075690000599',
                                  '02820075690000699',
                                  '02820075690000799',
                                  '02820075690000899',
                                  '02820075690000999'
          ))  A
WHERE A.GONGGEUM_GYEJWA NOT IN (
    SELECT
        REF_CTNT1
    FROM
        RPT_CODE_INFO
    WHERE
        REF_L_C = 110
      AND REF_M_C = NVL(28, REF_M_C)
      AND REF_S_C = NVL(200, REF_S_C)
    )
GROUP BY A.GUBUN, A.GONGGEUM_GYEJWA, A.GONGGEUM_GYEJWA_NM
ORDER BY A.GUBUN, A.GONGGEUM_GYEJWA, A.GONGGEUM_GYEJWA_NM



    GUBUN	GONGGEUM_GYEJWA	GONGGEUM_GYEJWA_NM


3	02820001600000499	서창2동 세입세출외현금출납원 14
3	02820080600000899	만수6동 세입세출외현금출납원 15
3	02820080600000999	논현고잔동 세입세출외현금출납원 16
3	02820080600001399	만수4동 세입세출외현금출납원 17
3	02820080600001499	만수3동 세입세출외현금출납원 18
3	02820080600001599	남촌도림동 세입세출외현금출납원 19
3	02820080600001699	간석4동 세입세출외현금출납원 20
3	02820080600001799	간석2동 세입세출외현금출납원 21
3	02820080600001899	구월2동 세입세출외현금출납원 22
3	02820080600001999	만수1동 세입세출외현금출납원 23
3	02820080600002199	논현1동세입세출외현금출납원 24
3	02820080600002299	간석3동세입세출외현금출납원 25
3	02820080600002399	만수5동세입세출외현금출납원 26


1	02820001600000199	토지구획정리사업특별회계(도림지구) 61
1	02820001600000299	토지구획정리사업특별회계(기반시설) 62
1	02820001900000199	남동구청(과오납환불예치금 세외수입) 63
1	02820080600000499	지식정보센터(폐쇄-세입세출외) 64
1	02820080900000099	남동구청(원도심활성화특별회계 재배정자금) 65




2	028200756900001YY	통합재정안정화기금(재정안정화계정) 136
2	028200756900002YY	고향사랑기금 137




INSERT ALL
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3), (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '14', '행번호14', '0', '02820001600000499', '세입세출외현금', '서창2동 세입세출외현금출납원')


INSERT ALL
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '14', '행번호14', '0', '02820001600000499', '세입세출외현금', '서창2동 세입세출외현금출납원')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '15', '행번호15', '0', '02820080600000899', '세입세출외현금', '만수6동 세입세출외현금출납원')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '16', '행번호16', '0', '02820080600000999', '세입세출외현금', '논현고잔동 세입세출외현금출납원')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '17', '행번호17', '0', '02820080600001399', '세입세출외현금', '만수4동 세입세출외현금출납원')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '18', '행번호18', '0', '02820080600001499', '세입세출외현금', '만수3동 세입세출외현금출납원')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '19', '행번호19', '0', '02820080600001599', '세입세출외현금', '남촌도림동 세입세출외현금출납원')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '20', '행번호20', '0', '02820080600001699', '세입세출외현금', '간석4동 세입세출외현금출납원')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '21', '행번호21', '0', '02820080600001799', '세입세출외현금', '간석2동 세입세출외현금출납원')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '22', '행번호22', '0', '02820080600001899', '세입세출외현금', '구월2동 세입세출외현금출납원')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '23', '행번호23', '0', '02820080600001999', '세입세출외현금', '만수1동 세입세출외현금출납원')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '24', '행번호24', '0', '02820080600002199', '세입세출외현금', '논현1동 세입세출외현금출납원')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '25', '행번호25', '0', '02820080600002299', '세입세출외현금', '간석3동 세입세출외현금출납원')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '26', '행번호26', '0', '02820080600002399', '세입세출외현금', '만수5동 세입세출외현금출납원')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '61', '행번호61', '0', '02820001600000199', '특별회계', '토지구획정리사업특별회계(도림지구)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '62', '행번호62', '0', '02820001600000299', '특별회계', '토지구획정리사업특별회계(기반시설)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '63', '행번호63', '0', '02820001900000199', '특별회계', '남동구청(과오납환불예치금 세외수입)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '64', '행번호64', '0', '02820080600000499', '특별회계', '지식정보센터(폐쇄-세입세출외)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '65', '행번호65', '0', '02820080900000099', '특별회계', '남동구청(원도심활성화특별회계 재배정자금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '136', '행번호136', '0', '028200756900001YY', '기금', '통합재정안정화기금(재정안정화계정)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '200', '남동구청', '137', '행번호137', '0', '028200756900002YY', '기금', '고향사랑기금')
SELECT * FROM DUAL
