SELECT
    A.GUBUN,
    A.GONGGEUM_GYEJWA,
    A.GONGGEUM_GYEJWA_NM
FROM
    (
        SELECT
            FIL_100_CTNT5 AS GONGGEUM_GYEJWA,
            CASE WHEN SIGUMGO_AC_NM LIKE '%기금%' THEN 2
                 WHEN SIGUMGO_AC_NM LIKE '%세입세출외현금%' THEN 3
                 ELSE 1 END AS GUBUN,
            SIGUMGO_AC_NM AS GONGGEUM_GYEJWA_NM
        FROM ACL_SIGUMGO_MAS
        WHERE MNG_NO = 1
          AND FIL_100_CTNT5 IN (
                                '02824580600000999',
                                '02824580600000899',
                                '02824580600000799',
                                '02824580600000699',
                                '02824541200000024',
                                '02824580600000599',
                                '02824580600000499',
                                '02824580600000399',
                                '02824580600000199',
                                '02824580600000299',
                                '02824580600000099',
                                '02824575690000223',
                                '02824575690000224',
                                '02824575690000324',
                                '02824580900000499',
                                '02824580900000099',
                                '02824580900000399',
                                '02824501900000199',
                                '02824530200000124',
                                '02824530200000123',
                                '02824580600001899',
                                '02824580600001799',
                                '02824580600001699',
                                '02824580600001599',
                                '02824580600001399',
                                '02824580600001299',
                                '02824527100000022'
            )
    ) A ORDER BY A.GUBUN, A.GONGGEUM_GYEJWA, A.GONGGEUM_GYEJWA_NM

    GUBUN	GONGGEUM_GYEJWA	GONGGEUM_GYEJWA_NM
1	02824501900000199	계양구청(과오납환불예치금 세외수입)
1	02824530200000123	계양구청(주차장특별회계 배정자금)
1	02824530200000124	계양구청(주차장특별회계 배정자금)
1	02824541200000024	계양구청(지하수특별회계 배정자금)
1	02824580900000099	서운일반산업단지 특별회계배정 14
1	02824580900000399	서운일반산업단지공공폐수처리시설사용료 15
1	02824580900000499	계양구청(원도심활성화특별회계 재배정자금) 16

2	02824527100000022	계양구청(의료보호기금특별회계 세입금) 57
2	02824575690000223	고향사랑기금 58
2	02824575690000224	고향사랑기금 59
2	02824575690000324	통합재정안정화기금(통합계정) 60


1	02824580600000099	계양구청(세입세출외현금) 71
1	02824580600000199	계산4동(세입세출외현금) 72
1	02824580600000299	작전1동(세입세출외현금) 73
1	02824580600000399	작전2동(세입세출외현금) 74
1	02824580600000499	작전서운동(세입세출외현금) 75
1	02824580600000599	계산1동(세입세출외현금) 76
1	02824580600000699	계산2동(세입세출외현금) 77
1	02824580600000799	계산3동(세입세출외현금) 78
1	02824580600000899	계양1동(세입세출외현금) 79
1	02824580600000999	계양2동(세입세출외현금) 80
1	02824580600001299	계양구보건소(세입세출외현금) 81
1	02824580600001399	계양구의회(세입세출외현금) 82
1	02824580600001599	효성1동(세입세출외현금) 83
1	02824580600001699	효성2동(세입세출외현금) 84
1	02824580600001799	계양3동(세입세출외현금) 85
1	02824580600001899	장기보건지소(세입세출외현금) 86



INSERT INTO RPT_CODE_INFO
(
        REF_L_C,
        REF_L_NM,
        REF_M_C,
        REF_M_NM,
        REF_S_C,
        REF_S_NM,
        REF_D_C,
        REF_D_NM,
        YUHYO_YN,
        REF_CTNT1,
        REF_CTNT2,
        REF_CTNT3
)
VALUES
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '14', '행번호14', '0', '02824580900000099', '특별회계', '서운일반산업단지 특별회계배정'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '15', '행번호15', '0', '02824580900000399', '특별회계', '서운일반산업단지공공폐수처리시설사용료'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '16', '행번호16', '0', '02824580900000499', '특별회계', '계양구청(원도심활성화특별회계 재배정자금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '57', '행번호57', '0', '028245271000000YY', '기금', '계양구청(의료보호기금특별회계 세입금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '58', '행번호58', '0', '028245756900002YY', '기금', '고향사랑기금'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '59', '행번호59', '0', '028245756900003YY', '기금', '통합재정안정화기금(통합계정)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '71', '행번호71', '0', '02824580600000099', '세입세출외현금', '계양구청(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '72', '행번호72', '0', '02824580600000199', '세입세출외현금', '계산4동(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '73', '행번호73', '0', '02824580600000299', '세입세출외현금', '작전1동(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '74', '행번호74', '0', '02824580600000399', '세입세출외현금', '작전2동(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '75', '행번호75', '0', '02824580600000499', '세입세출외현금', '작전서운동(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '76', '행번호76', '0', '02824580600000599', '세입세출외현금', '계산1동(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '77', '행번호77', '0', '02824580600000699', '세입세출외현금', '계산2동(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '78', '행번호78', '0', '02824580600000799', '세입세출외현금', '계산3동(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '79', '행번호79', '0', '02824580600000899', '세입세출외현금', '계양1동(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '80', '행번호80', '0', '02824580600000999', '세입세출외현금', '계양2동(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '81', '행번호81', '0', '02824580600001299', '세입세출외현금', '계양구보건소(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '82', '행번호82', '0', '02824580600001399', '세입세출외현금', '계양구의회(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '83', '행번호83', '0', '02824580600001599', '세입세출외현금', '효성1동(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '84', '행번호84', '0', '02824580600001699', '세입세출외현금', '효성2동(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '85', '행번호85', '0', '02824580600001799', '세입세출외현금', '계양3동(세입세출외현금)'),
    ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '86', '행번호86', '0', '02824580600001899', '세입세출외현금', '장기보건지소(세입세출외현금)')


INSERT ALL
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)
VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '14', '행번호14', '0', '02824580900000099', '특별회계', '서운일반산업단지 특별회계배정')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3) VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '15', '행번호15', '0', '02824580900000399', '특별회계', '서운일반산업단지공공폐수처리시설사용료')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3) VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '16', '행번호16', '0', '02824580900000499', '특별회계', '계양구청(원도심활성화특별회계 재배정자금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '57', '행번호57', '0', '028245271000000YY', '기금', '계양구청(의료보호기금특별회계 세입금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '58', '행번호58', '0', '028245756900002YY', '기금', '고향사랑기금')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '59', '행번호59', '0', '028245756900003YY', '기금', '통합재정안정화기금(통합계정)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '71', '행번호71', '0', '02824580600000099', '세입세출외현금', '계양구청(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '72', '행번호72', '0', '02824580600000199', '세입세출외현금', '계산4동(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '73', '행번호73', '0', '02824580600000299', '세입세출외현금', '작전1동(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '74', '행번호74', '0', '02824580600000399', '세입세출외현금', '작전2동(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '75', '행번호75', '0', '02824580600000499', '세입세출외현금', '작전서운동(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '76', '행번호76', '0', '02824580600000599', '세입세출외현금', '계산1동(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '77', '행번호77', '0', '02824580600000699', '세입세출외현금', '계산2동(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '78', '행번호78', '0', '02824580600000799', '세입세출외현금', '계산3동(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '79', '행번호79', '0', '02824580600000899', '세입세출외현금', '계양1동(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '80', '행번호80', '0', '02824580600000999', '세입세출외현금', '계양2동(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '81', '행번호81', '0', '02824580600001299', '세입세출외현금', '계양구보건소(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '82', '행번호82', '0', '02824580600001399', '세입세출외현금', '계양구의회(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '83', '행번호83', '0', '02824580600001599', '세입세출외현금', '효성1동(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '84', '행번호84', '0', '02824580600001699', '세입세출외현금', '효성2동(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '85', '행번호85', '0', '02824580600001799', '세입세출외현금', '계양3동(세입세출외현금)')
INTO RPT_CODE_INFO (REF_L_C, REF_L_NM, REF_M_C, REF_M_NM, REF_S_C, REF_S_NM, REF_D_C, REF_D_NM, YUHYO_YN, REF_CTNT1, REF_CTNT2, REF_CTNT3)  VALUES ('110', '구청별잔액산출계좌', '28', '인천광역시', '245', '계양구청', '86', '행번호86', '0', '02824580600001899', '세입세출외현금', '장기보건지소(세입세출외현금)')
SELECT * FROM DUAL

